load-tests/artillery-auth.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 30
      name: "Medium load"
    - duration: 180
      arrivalRate: 50
      name: "High load"
    - duration: 60
      arrivalRate: 10
      name: "Ramp down"
  processor: "./artillery-processor.js"
  variables:
    password: "testpassword123"
  plugins:
    expect: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Authentication Load Test"
    weight: 100
    flow:
      # Step 1: Register user
      - post:
          url: "/auth/register"
          json:
            username: "loadtest_{{ $randomString() }}_{{ $timestamp }}"
            password: "{{ password }}"
          capture:
            - json: "$.username"
              as: "registeredUsername"
          expect:
            - statusCode: [200, 201, 409]
      
      - think: 0.5
      
      # Step 2: Login
      - post:
          url: "/auth/login"
          json:
            username: "{{ registeredUsername }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: [200, 401]
            - contentType: json
      
      - think: 0.5
      
      # Step 3: Validate token
      - get:
          url: "/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: [200, 401]
            - contentType: json
      
      - think: 1